{
	"id": "038030",
	"title": "The Ides of March",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038030.jpg",
    "summary": "The Democratic Party presidential primary process is currently in Ohio, where two candidates are realistically still in the running as the ultimate party nominee for president: Pennsylvanian Governor, Mike Morris, and Arkansas senator, Ted Pullman. Based on what is happening on the Republican side, the Democrats are likely to win the White House, and whoever wins the Ohio primary will likely be the Democratic candidate. Under campaign manager Paul Zara, thirty year old Stephen Meyers is the idealistic press secretary for the Morris campaign. Although Stephen is a political veteran, he has never felt more passionately about a candidate than Morris, who outwardly aspires to a campaign that deals with his policies reflecting his ideals as opposed to back room politics. Stephen takes a calculated risk, one that does not pay off as his actions are leaked to reporter Ida Horowicz, who had been friendly to the campaign up to this point. Ida gives Stephen the opportunity to confirm or deny the accusations before she goes to print, the story which would ruin his standing within the campaign. Stephen also begins a casual sexual relationship with twenty year old intern Molly Stearns, who is well connected herself within the party as the daughter of Jack Stearns, the Chair of the Democratic National Committee. Through Molly, Stephen inadvertently comes into knowledge of some scandalous information about Morris. Stephen has to decide how all these revelations affect his own idealistic attitudes of working under Morris and Zara, and if Morris winning the White House is still the most important goal, especially at the risk of his own professional future within the party and possibly within government.",
    "cast": "Paul Giamatti, George Clooney, Philip Seymour Hoffman",
	"director":  "George Clooney",
    "year": "2011",
    "trailer": "https://www.youtube.com/watch?v=y494hUO-aw8"
}
