{
	"id": "038014",
	"title": "Joy",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038014.jpg",
    "summary": "Joy has always been fascinated by creating things, This pursuit was always supported emotionally by her maternal grandmother, Mimi. Joy feels that lack of practical support has led to others making fortunes on ideas she came up with years ago but could not act upon manufacturing. Despite being broke, Joy is the person in her extended family to whom everyone has always turned, in the process forgoing her own life, including not having attended college to help see her parents through their divorce. She works in an unsatisfying job as an Eastern Airlines ticket clerk; and lives with her mother Terry who spends all day in bed watching soap operas; her ex-husband Tony, a less than successful aspiring Latino Tom Jones wannabe; and their two children. Added to this mix is her father Rudy, the owner of a failing heavy-duty garage, which is managed by Joy's older half-sister Peggy, with whom she has somewhat of a strained relationship, and for which Joy does the books. Sharon, Rudy's latest girlfriend who has just dumped him, drops him off on Joy's doorstep, making Joy's home life even more complicated as Rudy does not get along with either Terry or Tony. Joy begins to feel buried by her life, in the process her childhood dream of making things seemingly getting farther and farther away. As such, Joy decides to make some changes in her life, and expects the unquestioning practical support of her family. Those changes include manufacturing a new product of her design; what she chooses this time around being a self-wringing mop. That support also includes being able to pitch the idea to Rudy's current wealthy girlfriend, Trudy. Even if she does get to the manufacturing stage, Joy will have to battle the narrow minds of business executives in marketing her product, that is unless she can find a way to get into the homes of the American public in one fell swoop. But nothing is a done deal until the consumer forks out his/her hard earned money for the product and all the legal issues are dealt with. Joy has to decide if she will 'pick up the gun' as Trudy asked in their initial investment meeting in dealing with an especially troublesome legal issue.",
    "cast": "Jennifer Lawrence, Robert De Niro, Bradley Cooper",
	"director":  "David O. Russell",
    "year": "2015",
    "trailer": "https://www.youtube.com/watch?v=2zqy21Z29ps"
}
